---
kind: method
id: M:Autodesk.Revit.DB.IUpdater.GetAdditionalInformation
source: html/b666e9bf-5ef2-a8c4-0182-2d4296279fac.htm
---
# Autodesk.Revit.DB.IUpdater.GetAdditionalInformation Method

Auxiliary text that Revit will use to inform the end user
 when the Updater is not loaded

## Syntax (C#)
```csharp
string GetAdditionalInformation()
```